#----------------information list---------------
'''
เป็นส่วนระบุเขตทั้งหมดที่อยู่ในจังหวัดกรุงเทพมหาคร การแบ่งประเภทอาคาร และกำหนดผังสี 
'''


district_zoning_rules = {
    "บางกะปิ": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "บางเขน": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "บางคอแหลม": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "บางนา": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "บางรัก": ["สีแดง", "สีน้ำตาล", "สีน้ำเงิน"],
    "บางซื่อ": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีม่วง", "สีน้ำเงิน"],
    "บึงกุ่ม": ["สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "จตุจักร": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "ดินแดง": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "ดอนเมือง": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "ดุสิต": ["สีแดง", "สีส้ม", "สีน้ำตาลอ่อน", "สีน้ำเงิน"],
    "ห้วยขวาง": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "คันนายาว": ["สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "คลองสามวา": ["สีเหลือง", "สีเขียว", "สีขาวมีกรอบและเส้นทแยงสีเขียว", "สีน้ำเงิน"],
    "คลองเตย": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "หลักสี่": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "ลาดกระบัง": ["สีแดง", "สีส้ม", "สีเหลือง", "สีม่วง", "สีเม็ดมะปราง", "สีเขียว", "สีน้ำเงิน"],
    "ลาดพร้าว": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "มีนบุรี": ["สีแดง", "สีส้ม", "สีเหลือง", "สีม่วง", "สีเขียว", "สีน้ำเงิน"],
    "หนองจอก": ["สีเหลือง", "สีเขียว", "สีขาวมีกรอบและเส้นทแยงสีเขียว", "สีม่วง", "สีน้ำเงิน"],
    "ปทุมวัน": ["สีแดง", "สีน้ำตาล", "สีน้ำเงิน"],
    "พญาไท": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "พระโขนง": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "พระนคร": ["สีแดง", "สีน้ำตาลอ่อน", "สีน้ำเงิน"],
    "ป้อมปราบศัตรูพ่าย": ["สีแดง", "สีน้ำตาลอ่อน", "สีน้ำเงิน"],
    "ประเวศ": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "ราชเทวี": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "สัมพันธวงศ์": ["สีแดง", "สีน้ำตาลอ่อน", "สีน้ำเงิน"],
    "สายไหม": ["สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "สะพานสูง": ["สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "สาทร": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "สวนหลวง": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "วังทองหลาง": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "วัฒนา": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "ยานนาวา": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "บางบอน": ["สีแดง", "สีส้ม", "สีเหลือง", "สีม่วง", "สีน้ำเงิน"],
    "บางแค": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "บางขุนเทียน": ["สีแดง", "สีส้ม", "สีเหลือง", "สีม่วง", "สีเขียว", "สีขาวมีกรอบและเส้นทแยงสีเขียว", "สีน้ำเงิน"],
    "บางกอกน้อย": ["สีแดง", "สีส้ม", "สีน้ำตาลอ่อน", "สีน้ำเงิน"],
    "บางกอกใหญ่": ["สีส้ม", "สีน้ำตาลอ่อน", "สีน้ำเงิน"],
    "บางพลัด": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "จอมทอง": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "คลองสาน": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "หนองแขม": ["สีแดง", "สีส้ม", "สีเหลือง", "สีม่วง", "สีน้ำเงิน"],
    "ภาษีเจริญ": ["สีแดง", "สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
    "ราษฎร์บูรณะ": ["สีแดง", "สีส้ม", "สีม่วง", "สีน้ำเงิน"],
    "ตลิ่งชัน": ["สีส้ม", "สีเหลือง", "สีเขียว", "สีขาวมีกรอบและเส้นทแยงสีเขียว", "สีน้ำเงิน"],
    "ทวีวัฒนา": ["สีเหลือง", "สีเขียว", "สีขาวมีกรอบและเส้นทแยงสีเขียว", "สีน้ำเงิน"],
    "ธนบุรี": ["สีแดง", "สีน้ำตาล", "สีส้ม", "สีน้ำเงิน"],
    "ทุ่งครุ": ["สีส้ม", "สีเหลือง", "สีน้ำเงิน"],
}

regulation_type_districts = {
    "สีเหลือง": ["ย1", "ย2", "ย3", "ย4", "ย5"],
    "สีส้ม": ["ย6", "ย7", "ย8", "ย9", "ย10"],
    "สีน้ำตาล": ["ย11", "ย12", "ย13", "ย14", "ย15"],
    "สีแดง": ["พ1", "พ2", "พ3", "พ4", "พ5", "พ6", "พ7", "พ8"],
    "สีม่วง": ["อ1", "อ2"],
    "สีเม็ดมะปราง": ["อ3"],
    "สีขาวมีกรอบและเส้นทแยงสีเขียว": ["ก1", "ก2"],
    "สีเขียว": ["ก3"],
    "สีน้ำเงิน": ["ส"]
}

far_osr_data = {
    "ย1": {"far": 1.0, "osr": 40.0},
    "ย2": {"far": 1.5, "osr": 20.0},
    "ย3": {"far": 2.0, "osr": 15.0},
    "ย4": {"far": 2.5, "osr": 12.0},
    "ย5": {"far": 3.0, "osr": 10.0},
    "ย6": {"far": 3.5, "osr": 8.5},
    "ย7": {"far": 4.0, "osr": 7.5},
    "ย8": {"far": 4.5, "osr": 6.5},
    "ย9": {"far": 5.0, "osr": 6.0},
    "ย10": {"far": 5.5, "osr": 5.5},
    "ย11": {"far": 6.0, "osr": 5.0},
    "ย12": {"far": 6.5, "osr": 4.5},
    "ย13": {"far": 7.0, "osr": 4.5},
    "ย14": {"far": 7.5, "osr": 4.0},
    "ย15": {"far": 8.0, "osr": 4.0},
    "พ1": {"far": 3.0, "osr": 10.0},
    "พ2": {"far": 4.0, "osr": 7.5},
    "พ3": {"far": 5.0, "osr": 6.0},
    "พ4": {"far": 6.0, "osr": 5.0},
    "พ5": {"far": 7.0, "osr": 4.5},
    "พ6": {"far": 7.0, "osr": 4.5},
    "พ7": {"far": 8.0, "osr": 4.0},
    "พ8": {"far": 10.0, "osr": 3.0},
    "อ1": {"far": 2.0, "osr": 10.0},
    "อ2": {"far": 1.5, "osr": 20.0},
    "อ3": {"far": 1.0, "osr": 40.0},
    "ก1": {"far": 0.5, "osr": 40.0},
    "ก2": {"far": 1.0, "osr": 40.0},
    "ก3": {"far": 1.5, "osr": 30.0},
    "ส": {"far": 0.0, "osr": 0.0} 
}

far_osr_type = {
    "สีเหลือง": "ที่อยู่อาศัยหนาแน่นน้อย",
    "สีส้ม": "ที่อยู่อาศัยหนาแน่นปานกลาง",
    "สีน้ำตาล": "ที่อยู่อาศัยหนาแน่นมาก",
    "สีแดง": "พาณิชยกรรม",
    "สีม่วง": "อุตสาหกรรม",
    "สีเม็ดมะปราง": "คลังสินค้า",
    "สีขาวมีกรอบและเส้นทแยงสีเขียว": "อนุรักษ์ชนบทและเกษตรกรรม",
    "สีเขียว": "ชนบทและเกษตรกรรม",
    "สีน้ำเงิน": "ที่ดินประเภทสถาบันราชการ การสาธารณูปโภค และสาธารณูปการ"
}


optional_far = ["ที่อยู่อาศัยผู้มีรายได้น้อย", "ที่โล่งเพื่อประโยชน์สาธารณะ", "ที่จอดรถสำหรับประชาชน", "พื้นที่รับน้ำ", "อาคารอนุรักษ์พลังงาน"]

